docs/notes/the-grand-weightloss-party.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!--  -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Grand Weight Loss Party</title>
<meta name="author" content="Pankaj Jangid" />
<meta name="description" content="Three friends, a company gymnasium in Noida, and ten kilograms' worth of reason to celebrate. A short story from the early HCL Technologies days and what started as an ordinary workout routine." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />

<link rel="canonical" href="https://jangid.info/notes/the-grand-weightloss-party.html"/>
<meta name="description" content="Three friends, a company gymnasium in Noida, and ten kilograms&apos; worth of reason to celebrate. A short story from the early HCL Technologies days and what started as an ordinary workout routine."/>
<meta property="og:type" content="article"/>
<meta property="og:site_name" content="Pankaj Jangid"/>
<meta property="og:title" content="The Grand Weight Loss Party"/>
<meta property="og:description" content="Three friends, a company gymnasium in Noida, and ten kilograms&apos; worth of reason to celebrate. A short story from the early HCL Technologies days and what started as an ordinary workout routine."/>
<meta property="og:url" content="https://jangid.info/notes/the-grand-weightloss-party.html"/>
<meta name="twitter:card" content="summary"/>
<meta name="twitter:site" content="@jangid"/>
<meta name="twitter:title" content="The Grand Weight Loss Party"/>
<meta name="twitter:description" content="Three friends, a company gymnasium in Noida, and ten kilograms&apos; worth of reason to celebrate. A short story from the early HCL Technologies days and what started as an ordinary workout routine."/>
<link rel="alternate" type="application/rss+xml" title="Pankaj Jangid — Notes" href="/notes/feed.xml"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a href="/">Home</a><a href="/notes/">Notes</a></nav>
</div>
<div id="content" class="content">
<p class="eyebrow"><a href="/notes/tags/personal.html">personal</a></p>
<h1 class="title">The Grand Weight Loss Party</h1>
<p>
About a month ago, we all (Abhilash, Dinesh, and I) started going to the company gymnasium with different motives. Despite having good looks, Abhilash had a misunderstanding that he did not look good. And to rectify that, he started a regular workout every day. I wanted to build some muscle now. I know it is late. But it is never too late, you know. Dinesh has a deep back and wanted to fill that with muscles.
</p>

<p>
Many things happen on our way to wisdom. Dinesh separated from us as he joined Sequence Design. But Abhilash's achievement was surprising. He lost 10 kg in a month. Check his full advice at <a href="http://kahani-zindagi-ki.blogspot.com/2007/08/blog-post_7519.html">Abhilash's Blog</a>. And we needed no more reasons to celebrate. We started asking for a party when he lost 9.5 kg. He promised to throw a party when he completed a 10 kg loss. We said ok.
</p>

<p>
Although Abhilash tried hard to keep his weight loss below 10 kg, yesterday he was 11.5 kg less than where he started. We reminded him of his promise. Ripul insisted on a dinner party. But we could not decide. After some time, Abhilash leaked the secret of Dal-Bati. And Ripul again insisted on a dinner party with Dal-Bati in the course. Abhilash agreed.
</p>

<p>
All of us left the office at 5:00 PM. Abhilash went home to help Uma prepare a nice treat for all of us, and we (Ripul and I) headed towards my home to pick up Sarita and Naini. Then we picked up Preeti from her office and reached Kendriya Vihar, Sector 50, Noida, at Abhilash's residence for a mouth-watering supper. Rahul was busy in some teleconference so he could not attend the party.
</p>

<p>
All had more than twice our usual capacity. The meal was so tasty that we could not resist taking more and more and more&hellip; seriously. Now I know the secret behind Abhilash's weight gain. Abhilash resisted too much but could not help it. He also ate twice his usual diet. Then we had sweets too. Overall, a very well-hosted treat.
</p>

<p>
Thanks Abhilash and Uma for the best hospitality. But Abhilash, now you should start eating a full diet, leaving your specialised low-calorie meal. Now you look super cool.
</p>
</div>
<div id="postamble" class="status">
<nav class="prev-next"><a class="newer" href="./karamchand-and-byomkesh-bakshi-were-the-best-detectives.html"><span class="label">Newer</span><span class="title">&larr; Karamchand and Byomkesh Bakshi Were the Best Detectives</span></a><a class="older" href="./perception-of-right-and-wrong.html"><span class="label">Older</span><span class="title">Perception of Right and Wrong &rarr;</span></a></nav><p class="date">Published: 2007-08-22</p><div class="site-footer"><span><a href="mailto:pankaj@jangid.info">pankaj@jangid.info</a></span><span class="sep">·</span><span><a href="https://x.com/jangid" rel="me">X</a></span><span class="sep">·</span><span><a href="https://www.linkedin.com/in/pankaj-jangid/" rel="me">LinkedIn</a></span><span class="sep">·</span><span><a href="https://github.com/jangid" rel="me">GitHub</a></span></div><div class="legal">&copy; 2005&ndash;2026 Pankaj Jangid. Prose licensed under <a href="https://creativecommons.org/licenses/by/4.0/">CC BY 4.0</a>; code snippets under the MIT License.</div>
</div>
</body>
</html>
